Revit 2027 API
FamilyInstanceCreationData(FamilySymbol, IList<XYZ>) Constructor
Initializes a new instance of the FamilyInstanceCreationData class
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyInstanceCreationData(
	FamilySymbol symbol,
	IList<XYZ> adaptivePoints
)
Public Sub New (
	symbol As FamilySymbol,
	adaptivePoints As IList(Of XYZ)
)
public:
FamilyInstanceCreationData(
	FamilySymbol^ symbol,
	IList<XYZ^>^ adaptivePoints
)
new :
        symbol : FamilySymbol *
        adaptivePoints : IList<XYZ> -> FamilyInstanceCreationData
Parameters
symbol FamilySymbol
 A FamilySymbol object that represents the type of the instance that is to be inserted.
adaptivePoints IList<XYZ>
 The adaptive points where the adaptive instance is to be initialized.
See Also
Reference
FamilyInstanceCreationData Class
FamilyInstanceCreationData Overload
Autodesk.Revit.Creation Namespace